Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128S1.atdf
<?xml version="1.0"?>
<!--
  Copyright %copyright_year% Microchip Technology Inc.

  SPDX-License-Identifier: Apache-2.0

  Licensed under the Apache License, Version 2.0 (the "License");
  you may not use this file except in compliance with the License.
  You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an "AS IS" BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2022-04-29T12:44:51Z"/>
  <variants>
    <variant ordercode="PIC32CX1025MTSH128-AU" package="TQFP128" pinout="TQFP128" speedmax="240" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="2.25"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M4" family="PIC32CXMT" name="PIC32CX1025MTSH128S1" series="PIC32CXMTSH">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="IRAM1" start="0x20080000" size="0x00008000" type="ram"/>
          <memory-segment name="IRAM2" start="0x20088000" size="0x00004000" type="ram"/>
          <memory-segment name="CORTEXM_PRIVATE_PB" start="0xE0000000" size="0x00100000" type="other"/>
        </address-space>
      </address-spaces>
      <peripherals>
        <module name="ACC" id="04597" version="C">
          <instance name="ACC">
            <register-group address-space="base" name="ACC" name-in-module="ACC" offset="0x40028000"/>
            <parameters>
              <param name="INSTANCE_ID" value="25"/>
              <param name="CLOCK_ID" value="25"/>
            </parameters>
            <signals>
              <signal pad="PA29" function="X1" group="AD" index="0"/>
              <signal pad="PA29" function="X1" group="ACC_INP" index="0"/>
              <signal pad="PA29" function="X1" group="XIN"/>
              <signal pad="PA30" function="X1" group="AD" index="1"/>
              <signal pad="PA30" function="X1" group="ACC_INP" index="1"/>
              <signal pad="PA31" function="X1" group="AD" index="2"/>
              <signal pad="PA31" function="X1" group="ACC_INP" index="2"/>
              <signal pad="PB0" function="X1" group="AD" index="3"/>
              <signal pad="PB0" function="X1" group="ACC_INN" index="0"/>
              <signal pad="PB0" function="X1" group="XOUT"/>
              <signal pad="PB1" function="X1" group="AD" index="4"/>
              <signal pad="PB1" function="X1" group="ACC_INN" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="ADC" id="44134" version="N">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0x40024000"/>
            <parameters>
              <param name="INSTANCE_ID" value="24"/>
              <param name="CLOCK_ID" value="24"/>
            </parameters>
            <signals>
              <signal pad="PA29" function="X1" group="AD" index="0"/>
              <signal pad="PA29" function="X1" group="ACC_INP" index="0"/>
              <signal pad="PA29" function="X1" group="XIN"/>
              <signal pad="PA30" function="X1" group="AD" index="1"/>
              <signal pad="PA30" function="X1" group="ACC_INP" index="1"/>
              <signal pad="PA31" function="X1" group="AD" index="2"/>
              <signal pad="PA31" function="X1" group="ACC_INP" index="2"/>
              <signal pad="PB0" function="X1" group="AD" index="3"/>
              <signal pad="PB0" function="X1" group="ACC_INN" index="0"/>
              <signal pad="PB0" function="X1" group="XOUT"/>
              <signal pad="PB1" function="X1" group="AD" index="4"/>
              <signal pad="PB1" function="X1" group="ACC_INN" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZW">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x40050200"/>
          </instance>
        </module>
        <module name="DWDT" id="04686" version="C">
          <instance name="DWDT">
            <register-group address-space="base" name="DWDT" name-in-module="DWDT" offset="0x40052000"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="EMAFE" id="04742" version="C">
          <instance name="EMAFE">
            <register-group address-space="base" name="EMAFE" name-in-module="EMAFE" offset="0x48000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="75"/>
              <param name="CLOCK_ID" value="75"/>
              <param name="INSTANCE_ID_SLINK" value="76"/>
              <param name="INSTANCE_ID_DATA" value="77"/>
            </parameters>
            <signals>
              <signal pad="PD25" function="A" group="EMAFE_DIN" index="0"/>
              <signal pad="PD26" function="A" group="EMAFE_DIN" index="1"/>
              <signal pad="PD27" function="A" group="EMAFE_DIN" index="2"/>
              <signal pad="PD28" function="A" group="EMAFE_DIN" index="3"/>
              <signal pad="PD24" function="A" group="EMAFE_FSYNC"/>
            </signals>
          </instance>
        </module>
        <module name="FLEXCOM" id="11268" version="ZH">
          <instance name="FLEXCOM0">
            <register-group address-space="base" name="FLEXCOM0" name-in-module="FLEXCOM" offset="0x40000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="9"/>
              <param name="CLOCK_ID" value="9"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA4" function="A" group="FLEXCOM0_IO" index="0"/>
              <signal pad="PA5" function="A" group="FLEXCOM0_IO" index="1"/>
              <signal pad="PA6" function="A" group="FLEXCOM0_IO" index="2"/>
              <signal pad="PA7" function="A" group="FLEXCOM0_IO" index="3"/>
              <signal pad="PA6" function="B" group="FLEXCOM0_IO" index="4"/>
              <signal pad="PA29" function="B" group="FLEXCOM0_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM1">
            <register-group address-space="base" name="FLEXCOM1" name-in-module="FLEXCOM" offset="0x40004000"/>
            <parameters>
              <param name="INSTANCE_ID" value="10"/>
              <param name="CLOCK_ID" value="10"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA8" function="A" group="FLEXCOM1_IO" index="0"/>
              <signal pad="PC2" function="B" group="FLEXCOM1_IO" index="0"/>
              <signal pad="PA9" function="A" group="FLEXCOM1_IO" index="1"/>
              <signal pad="PC3" function="B" group="FLEXCOM1_IO" index="1"/>
              <signal pad="PA10" function="A" group="FLEXCOM1_IO" index="2"/>
              <signal pad="PA11" function="A" group="FLEXCOM1_IO" index="3"/>
              <signal pad="PA10" function="B" group="FLEXCOM1_IO" index="4"/>
              <signal pad="PA29" function="C" group="FLEXCOM1_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM2">
            <register-group address-space="base" name="FLEXCOM2" name-in-module="FLEXCOM" offset="0x40008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
              <param name="CLOCK_ID" value="11"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA12" function="A" group="FLEXCOM2_IO" index="0"/>
              <signal pad="PA13" function="A" group="FLEXCOM2_IO" index="1"/>
              <signal pad="PA14" function="A" group="FLEXCOM2_IO" index="2"/>
              <signal pad="PA15" function="A" group="FLEXCOM2_IO" index="3"/>
              <signal pad="PA14" function="B" group="FLEXCOM2_IO" index="4"/>
              <signal pad="PA29" function="D" group="FLEXCOM2_IO" index="4"/>
            </signals>
          </instance>
