Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128S1.atdf
          <instance name="FLEXCOM3">
            <register-group address-space="base" name="FLEXCOM3" name-in-module="FLEXCOM" offset="0x4000C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="12"/>
              <param name="CLOCK_ID" value="12"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA16" function="A" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PB9" function="B" group="FLEXCOM3_IO" index="0"/>
              <signal pad="PA17" function="A" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PB10" function="B" group="FLEXCOM3_IO" index="1"/>
              <signal pad="PA18" function="A" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PB11" function="B" group="FLEXCOM3_IO" index="2"/>
              <signal pad="PA19" function="A" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PB12" function="B" group="FLEXCOM3_IO" index="3"/>
              <signal pad="PA18" function="B" group="FLEXCOM3_IO" index="4"/>
              <signal pad="PB0" function="B" group="FLEXCOM3_IO" index="4"/>
              <signal pad="PB11" function="C" group="FLEXCOM3_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM4">
            <register-group address-space="base" name="FLEXCOM4" name-in-module="FLEXCOM" offset="0x40010000"/>
            <parameters>
              <param name="INSTANCE_ID" value="13"/>
              <param name="CLOCK_ID" value="13"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PB5" function="B" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PB24" function="B" group="FLEXCOM4_IO" index="0"/>
              <signal pad="PB6" function="B" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PB25" function="B" group="FLEXCOM4_IO" index="1"/>
              <signal pad="PB7" function="B" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PB26" function="B" group="FLEXCOM4_IO" index="2"/>
              <signal pad="PB8" function="B" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PC0" function="B" group="FLEXCOM4_IO" index="3"/>
              <signal pad="PB7" function="C" group="FLEXCOM4_IO" index="4"/>
              <signal pad="PB26" function="C" group="FLEXCOM4_IO" index="4"/>
              <signal pad="PC1" function="B" group="FLEXCOM4_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM5">
            <register-group address-space="base" name="FLEXCOM5" name-in-module="FLEXCOM" offset="0x40014000"/>
            <parameters>
              <param name="INSTANCE_ID" value="14"/>
              <param name="CLOCK_ID" value="14"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA24" function="B" group="FLEXCOM5_IO" index="0"/>
              <signal pad="PB20" function="B" group="FLEXCOM5_IO" index="0"/>
              <signal pad="PC9" function="A" group="FLEXCOM5_IO" index="0"/>
              <signal pad="PA23" function="B" group="FLEXCOM5_IO" index="1"/>
              <signal pad="PB21" function="B" group="FLEXCOM5_IO" index="1"/>
              <signal pad="PC8" function="A" group="FLEXCOM5_IO" index="1"/>
              <signal pad="PA22" function="B" group="FLEXCOM5_IO" index="2"/>
              <signal pad="PB22" function="B" group="FLEXCOM5_IO" index="2"/>
              <signal pad="PC7" function="A" group="FLEXCOM5_IO" index="2"/>
              <signal pad="PA21" function="B" group="FLEXCOM5_IO" index="3"/>
              <signal pad="PB23" function="B" group="FLEXCOM5_IO" index="3"/>
              <signal pad="PC6" function="A" group="FLEXCOM5_IO" index="3"/>
              <signal pad="PA22" function="C" group="FLEXCOM5_IO" index="4"/>
              <signal pad="PB15" function="B" group="FLEXCOM5_IO" index="4"/>
              <signal pad="PB22" function="C" group="FLEXCOM5_IO" index="4"/>
              <signal pad="PC7" function="C" group="FLEXCOM5_IO" index="4"/>
            </signals>
          </instance>
          <instance name="FLEXCOM6">
            <register-group address-space="base" name="FLEXCOM6" name-in-module="FLEXCOM" offset="0x40018000"/>
            <parameters>
              <param name="INSTANCE_ID" value="15"/>
              <param name="CLOCK_ID" value="15"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PA0" function="A" group="FLEXCOM6_IO" index="0"/>
              <signal pad="PA25" function="B" group="FLEXCOM6_IO" index="0"/>
              <signal pad="PC6" function="B" group="FLEXCOM6_IO" index="0"/>
              <signal pad="PC16" function="A" group="FLEXCOM6_IO" index="0"/>
              <signal pad="PA1" function="A" group="FLEXCOM6_IO" index="1"/>
              <signal pad="PA26" function="B" group="FLEXCOM6_IO" index="1"/>
              <signal pad="PC7" function="B" group="FLEXCOM6_IO" index="1"/>
              <signal pad="PC17" function="A" group="FLEXCOM6_IO" index="1"/>
              <signal pad="PA27" function="B" group="FLEXCOM6_IO" index="2"/>
              <signal pad="PC18" function="A" group="FLEXCOM6_IO" index="2"/>
              <signal pad="PA28" function="B" group="FLEXCOM6_IO" index="3"/>
              <signal pad="PC19" function="A" group="FLEXCOM6_IO" index="3"/>
              <signal pad="PA27" function="C" group="FLEXCOM6_IO" index="4"/>
              <signal pad="PB16" function="B" group="FLEXCOM6_IO" index="4"/>
              <signal pad="PC18" function="B" group="FLEXCOM6_IO" index="4"/>
            </signals>
          </instance>
