Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128S1.atdf
      <value-group caption="Data Transfer Type" name="QSPI_IFR__TFRTYP">
        <value caption="Read/Write of memory register, write of memory page buffer. This configuration implies the following: Either the AHB or the APB interface can be used to initiate the transfer (SMRM bit). Returned data represents the memory register value. If the APB interface is used, the RDRF and TDRE flags help to control the frame. Scrambling is possible only if the APB interface is used. For HyperFlash memories the &quot;target&quot; bit is set to register space in the HyperFlash header." name="TRSFR_REGISTER" value="0"/>
        <value caption="Read/Write accesses to the memory space. This configuration implies the following: Only the System Bus interface can be used to trigger accesses. Access to random location is possible. Address mask is applied and full size accesses only are performed. Internal optimization algorithm is enabled to minimize latency. Data are returned in a system bus protocol compliant way. Seamless scrambling is enabled. Seamless handling of HyperFlash Write Buffer programming command (one command for each data) Seamless protocol-specific page boundary handling Address shift is handled seamlessly (e.g. halfword memories)." name="TRSFR_MEMORY" value="1"/>
      </value-group>
      <value-group caption="Continuous Read Mode" name="QSPI_IFR__CRM">
        <value caption="Continuous Read mode is disabled." name="DISABLED" value="0"/>
        <value caption="Continuous Read mode is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="DDR Mode Enable" name="QSPI_IFR__DDREN">
        <value caption="Transfers are performed in Single Data Rate mode." name="DISABLED" value="0"/>
        <value caption="Transfers are performed in Double Data Rate mode, whereas the instruction field is still transferred in Single Data Rate mode." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="DDR Mode Command Enable" name="QSPI_IFR__DDRCMDEN">
        <value caption="Transfer of instruction field is performed in Single Data Rate mode even if DDREN is written to '1'." name="DISABLED" value="0"/>
        <value caption="Transfer of instruction field is performed in Double Data Rate mode if DDREN bit is written to '1'. If DDREN is written to '0', the instruction field is sent in Single Data Rate mode." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Protocol Type" name="QSPI_IFR__PROTTYP">
        <value caption="Standard (Q)SPI Protocol" name="STD_SPI" value="0"/>
      </value-group>
      <value-group caption="Scrambling/Unscrambling Enable" name="QSPI_SMR__SCREN">
        <value caption="The scrambling/unscrambling is disabled." name="DISABLED" value="0"/>
        <value caption="The scrambling/unscrambling is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="QSPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x515350"/>
      </value-group>
      <value-group caption="Write Protection Key" name="QSPI_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
    </module>
    <module caption="Reset Controller" name="RSTC" id="04678" version="G">
      <register-group name="RSTC">
        <register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="Peripheral Reset" mask="0x00000004" name="PERRST"/>
          <bitfield caption="External Reset" mask="0x00000008" name="EXTRST"/>
          <bitfield caption="System Reset Key" mask="0xFF000000" name="KEY" values="RSTC_CR__KEY"/>
        </register>
        <register caption="Status Register" name="RSTC_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="User Reset Status (cleared on read)" mask="0x00000001" name="URSTS"/>
          <bitfield caption="VDDCORE Supply Monitor Reset Flag Status (cleared on read)" mask="0x00000002" name="CORESMS"/>
          <bitfield caption="Reset Type" mask="0x00000F00" name="RSTTYP" values="RSTC_SR__RSTTYP"/>
          <bitfield caption="NRST Pin Level" mask="0x00010000" name="NRSTL"/>
          <bitfield caption="Software Reset Command in Progress" mask="0x00020000" name="SRCMP"/>
        </register>
        <register caption="Mode Register" name="RSTC_MR" offset="0x08" rw="RW" size="4" initval="0x000000F5">
          <bitfield caption="User Reset Enable" mask="0x00000001" name="URSTEN"/>
          <bitfield caption="Slow Clock Switching" mask="0x00000002" name="SCKSW"/>
          <bitfield caption="User Reset Asynchronous Control" mask="0x00000004" name="URSTASYNC"/>
          <bitfield caption="CPU Fail Enable" mask="0x00000008" name="CPUFEN"/>
          <bitfield caption="User Reset Interrupt Enable" mask="0x00000010" name="URSTIEN"/>
          <bitfield caption="Software PMC Reset" mask="0x00000020" name="SFTPMCRS"/>
          <bitfield caption="WDT0 PMC Reset" mask="0x00000040" name="WDTPMC0"/>
          <bitfield caption="WDT1 PMC Reset" mask="0x00000080" name="WDTPMC1"/>
          <bitfield caption="External Reset Length" mask="0x00000F00" name="ERSTL"/>
          <bitfield caption="VDDCORE Supply Monitor Interrupt Enable" mask="0x00010000" name="CORSMIEN"/>
          <bitfield caption="Coprocessor Peripheral Enable" mask="0x00020000" name="CPEREN"/>
          <bitfield caption="Coprocessor (Second Processor) Enable" mask="0x00040000" name="CPROCEN"/>
          <bitfield caption="Backup Area Power Switch Control" mask="0x00200000" name="PWRSW" values="RSTC_MR__PWRSW"/>
          <bitfield caption="Bad XTAL Fail Reset" mask="0x00400000" name="BADXTRST"/>
          <bitfield caption="Write Access Password" mask="0xFF000000" name="KEY" values="RSTC_MR__KEY"/>
        </register>
      </register-group>
