Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX1025MTSH128S1.atdf
        <register name="STIR" offset="0xE00" rw="W" size="4" access-size="4" caption="Software Trigger Interrupt Register">
          <bitfield name="INTID" caption="Interrupt ID to trigger" mask="0x1FF"/>
        </register>
      </register-group>
    </module>
    <module name="SysTick" version="1.0.0" caption="System timer">
      <register-group name="SysTick" caption="System timer">
        <register name="CSR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x4" caption="SysTick Control and Status Register">
          <bitfield name="ENABLE" caption="SysTick Counter Enable" mask="0x1" values="SysTick_CSR__ENABLE"/>
          <bitfield name="TICKINT" caption="SysTick Exception Request Enable" mask="0x2" values="SysTick_CSR__TICKINT"/>
          <bitfield name="CLKSOURCE" caption="Clock Source 0=external, 1=processor" mask="0x4" values="SysTick_CSR__CLKSOURCE"/>
          <bitfield name="COUNTFLAG" caption="Timer counted to 0 since last read of register" mask="0x10000"/>
        </register>
        <register name="RVR" offset="0x4" rw="RW" size="4" access-size="4" caption="SysTick Reload Value Register">
          <bitfield name="RELOAD" caption="Value to load into the SysTick Current Value Register when the counter reaches 0" mask="0xFFFFFF"/>
        </register>
        <register name="CVR" offset="0x8" rw="RW" size="4" access-size="4" caption="SysTick Current Value Register">
          <bitfield name="CURRENT" caption="Current value at the time the register is accessed" mask="0xFFFFFF"/>
        </register>
        <register name="CALIB" offset="0xC" rw="R" size="4" access-size="4" initval="0" caption="SysTick Calibration Value Register">
          <bitfield name="TENMS" caption="Reload value to use for 10ms timing" mask="0xFFFFFF"/>
          <bitfield name="SKEW" caption="TENMS is rounded from non-integer ratio" mask="0x40000000" values="SysTick_CALIB__SKEW"/>
          <bitfield name="NOREF" caption="No Separate Reference Clock" mask="0x80000000" values="SysTick_CALIB__NOREF"/>
        </register>
      </register-group>
      <value-group name="SysTick_CSR__CLKSOURCE">
        <value name="VALUE_0" caption="External clock" value="0"/>
        <value name="VALUE_1" caption="Processor clock" value="1"/>
      </value-group>
      <value-group name="SysTick_CSR__ENABLE">
        <value name="VALUE_0" caption="Counter disabled" value="0"/>
        <value name="VALUE_1" caption="Counter enabled" value="1"/>
      </value-group>
      <value-group name="SysTick_CSR__TICKINT">
        <value name="VALUE_0" caption="Counting down to 0 does not assert the SysTick exception request" value="0"/>
        <value name="VALUE_1" caption="Counting down to 0 asserts the SysTick exception request" value="1"/>
      </value-group>
      <value-group name="SysTick_CALIB__NOREF">
        <value name="VALUE_0" caption="The reference clock is provided" value="0"/>
        <value name="VALUE_1" caption="The reference clock is not provided" value="1"/>
      </value-group>
      <value-group name="SysTick_CALIB__SKEW">
        <value name="VALUE_0" caption="10ms calibration value is exact" value="0"/>
        <value name="VALUE_1" caption="10ms calibration value is inexact, because of the clock frequency" value="1"/>
      </value-group>
    </module>
    <module name="SystemControl" version="1.0.0" caption="System Control Registers">
      <register-group name="SystemControl" caption="System Control Registers">
        <register name="ICTR" offset="0x4" rw="R" size="4" access-size="4" caption="Interrupt Controller Type Register">
          <bitfield name="INTLINESNUM" caption="" mask="0xF"/>
        </register>
        <register name="ACTLR" offset="0x8" rw="RW" size="4" access-size="4" caption="Auxiliary Control Register">
          <bitfield name="DISMCYCINT" caption="Disable interruption of LDM/STM instructions" mask="0x1"/>
          <bitfield name="DISDEFWBUF" caption="Disable wruite buffer use during default memory map accesses" mask="0x2"/>
          <bitfield name="DISFOLD" caption="Disable IT folding" mask="0x4"/>
          <bitfield name="DISFPCA" caption="Disable automatic update of CONTROL.FPCA" mask="0x100"/>
          <bitfield name="DISOOFP" caption="Disable out-of-order FP instructions" mask="0x200"/>
        </register>
        <register name="CPUID" offset="0xD00" rw="R" size="4" access-size="4" initval="0x410FC240" caption="CPUID Base Register">
          <bitfield name="REVISION" caption="Processor revision number" mask="0xF"/>
          <bitfield name="PARTNO" caption="Process Part Number, 0xC24=Cortex-M4" mask="0xFFF0"/>
          <bitfield name="CONSTANT" caption="Constant" mask="0xF0000"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF00000"/>
          <bitfield name="IMPLEMENTER" caption="Implementer code, 0x41=ARM" mask="0xFF000000"/>
        </register>
        <register name="ICSR" offset="0xD04" rw="RW" size="4" access-size="4" initval="0" caption="Interrupt Control and State Register">
          <bitfield name="VECTACTIVE" caption="Active exception number" mask="0x1FF"/>
          <bitfield name="RETTOBASE" caption="No preempted active exceptions to execute" mask="0x800"/>
          <bitfield name="VECTPENDING" caption="Exception number of the highest priority pending enabled exception" mask="0x3F000"/>
          <bitfield name="ISRPENDING" caption="Interrupt pending flag" mask="0x400000"/>
          <bitfield name="ISRPREEMPT" caption="Debug only" mask="0x800000"/>
          <bitfield name="PENDSTCLR" caption="SysTick clear-pending bit" mask="0x2000000" values="SystemControl_ICSR__PENDSTCLR"/>
          <bitfield name="PENDSTSET" caption="SysTick set-pending bit" mask="0x4000000" values="SystemControl_ICSR__PENDSTSET"/>
          <bitfield name="PENDSVCLR" caption="PendSV clear-pending bit" mask="0x8000000" values="SystemControl_ICSR__PENDSVCLR"/>
          <bitfield name="PENDSVSET" caption="PendSV set-pending bit" mask="0x10000000" values="SystemControl_ICSR__PENDSVSET"/>
          <bitfield name="NMIPENDSET" caption="NMI set-pending bit" mask="0x80000000" values="SystemControl_ICSR__NMIPENDSET"/>
        </register>
        <register name="VTOR" offset="0xD08" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Vector Table Offset Register">
          <bitfield name="TBLOFF" caption="Vector table base offset" mask="0xFFFFFF80"/>
        </register>
